XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ARM.Cortex_DFP.pdsc
      <device Dname="ARMCM4">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Configurable" Dclock="10000000"/>
        <compile header="Device/ARMCM4/Include/ARMCM4.h"    define="ARMCM4"/>

        <memory name="ROM" access="rx"  start="0x00000000" size="0x00040000" default="1" startup="1"/>
        <memory name="RAM" access="rwx" start="0x20000000" size="0x00020000" default="1"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M7  ****************************** -->
    <family Dfamily="ARM Cortex M7" Dvendor="ARM:82">
      <description>
The Cortex-M7 processor is a high performance 32-bit processor designed for the microcontroller market.
It offers significant benefits to developers, including:
- Outstanding processing performance combined with fast interrupt handling
- Enhanced system debug with extensive breakpoint and trace capabilities
- Efficient processor core, system and memories
- Ultra-low power consumption with integrated sleep mode and an optional deep sleep mode
- Platform security robustness, with optional integrated Memory Protection Unit (MPU)
      </description>

      <book name="https://developer.arm.com/documentation/dui0646" title="Cortex-M7 Processor Devices Generic Users Guide"/>

      <device Dname="ARMCM7">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="DP_FPU" Dmpu="MPU" Dendian="Configurable" Dclock="10000000"/>
        <compile header="Device/ARMCM7/Include/ARMCM7.h" define="ARMCM7"/>

        <memory name="ROM" access="rx"  start="0x00000000" size="0x00040000" default="1" startup="1"/>
        <memory name="RAM" access="rwx" start="0x20000000" size="0x00020000" default="1"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M23  ********************** -->
    <family Dfamily="ARM Cortex M23" Dvendor="ARM:82">
      <description>
The Cortex-M23 processor is an entry-level 32-bit Arm Cortex processor designed for a broad range of embedded applications.
It offers significant benefits to developers, including:
- A simple architecture that is easy to learn and program
- Ultra-low power, energy-efficient operation
- Excellent code density
- Deterministic, high-performance interrupt handling
- Upward compatibility with Cortex-M processor family
- Platform security robustness, with optional integrated memory protection
- Extended security features, with optional Security Extension for Armv8-M
      </description>

      <book name="https://developer.arm.com/documentation/dui1095" title="Cortex-M23 Processor Devices Generic Users Guide"/>

      <device Dname="ARMCM23">
        <processor Dcore="Cortex-M23" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="MPU" Dtz="TZ" Dendian="Configurable" Dclock="10000000"/>
        <compile header="Device/ARMCM23/Include/ARMCM23.h" define="ARMCM23"/>

        <memory name="ROM_S"  access="rxs"  start="0x00000000" size="0x00200000" default="1" startup="1"/>
        <memory name="RAM_S"  access="rwxs" start="0x20000000" size="0x00020000" default="1"/>
        <memory name="ROM_NS" access="rxn"  start="0x00200000" size="0x00200000" default="1" startup="1"/>
        <memory name="RAM_NS" access="rwxn" start="0x20200000" size="0x00020000" default="1"/>
     </device>
    </family>

    <!-- ******************************  Cortex-M33  ****************************** -->
    <family Dfamily="ARM Cortex M33" Dvendor="ARM:82">
      <description>
The Cortex®-M33 processor is a high-performance 32-bit processor that is designed for the microcontroller market.
The processor offers outstanding performance, fast interrupt handling, and enhanced system debug with extensive breakpoint and trace capabilities.
Other significant benefits to developers include:
- Efficient processor core, system, and memories
- Instruction set extension for signal processing applications
- Ultra-low power consumption with integrated sleep modes
- Platform robustness with optional integrated memory protection
- Extended security features with optional Security Extension for Armv8-M
      </description>

      <book name="https://developer.arm.com/documentation/100235" title="Cortex-M33 Processor Devices Generic Users Guide"/>

      <device Dname="ARMCM33">
        <processor Dcore="Cortex-M33" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dtz="TZ" Dendian="Configurable" Dclock="10000000"/>
        <compile header="Device/ARMCM33/Include/ARMCM33.h" define="ARMCM33"/>

        <memory name="ROM_S"  access="rxs"  start="0x00000000" size="0x00200000" default="1" startup="1"/>
        <memory name="RAM_S"  access="rwxs" start="0x20000000" size="0x00020000" default="1"/>
        <memory name="ROM_NS" access="rxn"  start="0x00200000" size="0x00200000" default="1" startup="1"/>
        <memory name="RAM_NS" access="rwxn" start="0x20200000" size="0x00020000" default="1"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M35P  ****************************** -->
    <family Dfamily="ARM Cortex M35P" Dvendor="ARM:82">
      <description>
The Arm Cortex-M35P is the most configurable of all Cortex-M processors. It is a full featured microcontroller
class processor based on the Armv8-M mainline architecture with Arm TrustZone security designed for a broad range of secure embedded applications.
      </description>

      <!--book name="https://developer.arm.com/documentation/??" title="Cortex M35P Processor Devices Generic Users Guide"/-->

      <device Dname="ARMCM35P">
        <processor Dcore="Cortex-M35P" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dtz="TZ" Dendian="Configurable" Dclock="10000000"/>
        <compile header="Device/ARMCM35P/Include/ARMCM35P.h" define="ARMCM35P"/>

        <memory name="ROM_S"  access="rxs"  start="0x00000000" size="0x00200000" default="1" startup="1"/>
        <memory name="RAM_S"  access="rwxs" start="0x20000000" size="0x00020000" default="1"/>
        <memory name="ROM_NS" access="rxn"  start="0x00200000" size="0x00200000" default="1" startup="1"/>
        <memory name="RAM_NS" access="rwxn" start="0x20200000" size="0x00020000" default="1"/>
      </device>
    </family>

