XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ARM.Cortex_DFP.pdsc
  </conditions>

  <components>
    <!-- CMSIS-Startup components -->
    <!-- Cortex-M0 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM0 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M0 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"  name="Device/ARMCM0/Include/ARMCM0.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM0/Source/startup_ARMCM0.c"     version="2.0.3" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM0/Source/system_ARMCM0.c"      version="1.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM0/Config/ARMCM0_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM0/Config/ARMCM0_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-M0+ -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM0+ CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M0+ device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"  name="Device/ARMCM0plus/Include/ARMCM0plus.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM0plus/Source/startup_ARMCM0plus.c"     version="3.0.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM0plus/Source/system_ARMCM0plus.c"      version="2.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM0plus/Config/ARMCM0plus_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM0plus/Config/ARMCM0plus_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-M1 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM1 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M1 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"  name="Device/ARMCM1/Include/ARMCM1.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM1/Source/startup_ARMCM1.c"     version="2.0.3" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM1/Source/system_ARMCM1.c"      version="1.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM1/Config/ARMCM1_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM1/Config/ARMCM1_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-M3 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM3 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M3 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"  name="Device/ARMCM3/Include/ARMCM3.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM3/Source/startup_ARMCM3.c"     version="2.0.3" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM3/Source/system_ARMCM3.c"      version="1.0.1" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM3/Config/ARMCM3_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM3/Config/ARMCM3_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-M4 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM4 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M4 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header" name="Device/ARMCM4/Include/ARMCM4.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM4/Source/startup_ARMCM4.c"     version="3.0.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM4/Source/system_ARMCM4.c"      version="2.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM4/Config/ARMCM4_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM4/Config/ARMCM4_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-M7 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM7 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M7 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header" name="Device/ARMCM7/Include/ARMCM7.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM7/Source/startup_ARMCM7.c"     version="3.0.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM7/Source/system_ARMCM7.c"      version="2.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM7/Config/ARMCM7_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM7/Config/ARMCM7_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-M23 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM23 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M23 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header" name="Device/ARMCM23/Include/ARMCM23.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM23/Source/startup_ARMCM23.c"             version="3.0.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM23/Source/system_ARMCM23.c"              version="2.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM23/Config/ARMCM23_ac6.sct"               version="1.1.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM23/Config/ARMCM23_gcc.ld"                version="2.3.0" attr="config" condition="GCC"/>
        <!-- SAU configuration -->
        <file category="header"  name="Device/ARMCM23/Config/partition_ARMCM23.h" version="1.0.0" attr="config" condition="TZ Secure"/>
      </files>
    </component>

    <!-- Cortex-M33 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM33 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M33 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header" name="Device/ARMCM33/Include/ARMCM33.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM33/Source/startup_ARMCM33.c"             version="3.0.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM33/Source/system_ARMCM33.c"              version="2.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM33/Config/ARMCM33_ac6.sct"               version="1.1.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM33/Config/ARMCM33_gcc.ld"                version="2.3.0" attr="config" condition="GCC"/>
        <!-- SAU configuration -->
        <file category="header"  name="Device/ARMCM33/Config/partition_ARMCM33.h" version="1.1.1" attr="config" condition="TZ Secure"/>
      </files>
    </component>

