XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ARM.Cortex_DFP.pdsc
    <!-- Cortex-M35P -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM35P CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm Cortex-M35P device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header" name="Device/ARMCM35P/Include/ARMCM35P.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM35P/Source/startup_ARMCM35P.c"             version="3.0.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM35P/Source/system_ARMCM35P.c"              version="2.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM35P/Config/ARMCM35P_ac6.sct"               version="1.1.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM35P/Config/ARMCM35P_gcc.ld"                version="2.3.0" attr="config" condition="GCC"/>
        <!-- SAU configuration -->
        <file category="header"  name="Device/ARMCM35P/Config/partition_ARMCM35P.h" version="1.0.0" attr="config" condition="TZ Secure"/>
      </files>
    </component>

    <!-- Cortex-M55 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM55 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Cortex-M55 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header" name="Device/ARMCM55/Include/ARMCM55.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM55/Source/startup_ARMCM55.c"             version="1.1.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM55/Source/system_ARMCM55.c"              version="1.1.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM55/Config/ARMCM55_ac6.sct"               version="1.1.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM55/Config/ARMCM55_gcc.ld"                version="2.3.0" attr="config" condition="GCC"/>
        <!-- SAU configuration -->
        <file category="header"  name="Device/ARMCM55/Config/partition_ARMCM55.h" version="1.0.0" attr="config" condition="TZ Secure"/>
      </files>
    </component>

    <!-- Cortex-M85 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMCM85 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Cortex-M85 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header" name="Device/ARMCM85/Include/ARMCM85.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMCM85/Source/startup_ARMCM85.c"             version="1.0.0" attr="config"/>
        <file category="sourceC"      name="Device/ARMCM85/Source/system_ARMCM85.c"              version="1.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMCM85/Config/ARMCM85_ac6.sct"               version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCM85/Config/ARMCM85_gcc.ld"                version="2.3.0" attr="config" condition="GCC"/>
        <!-- SAU configuration -->
        <file category="header"  name="Device/ARMCM85/Config/partition_ARMCM85.h" version="1.0.0" attr="config" condition="TZ Secure"/>
      </files>
    </component>

    <!-- Cortex-SC000 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMSC000 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm SC000 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"  name="Device/ARMSC000/Include/ARMSC000.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMSC000/Source/startup_ARMSC000.c"     version="2.0.3" attr="config"/>
        <file category="sourceC"      name="Device/ARMSC000/Source/system_ARMSC000.c"      version="1.0.0" attr="config"/>
        <file category="linkerScript" name="Device/ARMSC000/Config/ARMSC000_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMSC000/Config/ARMSC000_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-SC300 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="2.2.0" condition="ARMSC300 CMSIS" isDefaultVariant="true">
      <description>System and Startup for Generic Arm SC300 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"  name="Device/ARMSC300/Include/ARMSC300.h"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/ARMSC300/Source/startup_ARMSC300.c"     version="2.0.3" attr="config"/>
        <file category="sourceC"      name="Device/ARMSC300/Source/system_ARMSC300.c"      version="1.0.1" attr="config"/>
        <file category="linkerScript" name="Device/ARMSC300/Config/ARMSC300_ac6.sct"       version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMSC300/Config/ARMSC300_gcc.ld"        version="2.2.0" attr="config" condition="GCC"/>
      </files>
    </component>

    <!-- Cortex-A5 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.2.0" condition="ARMCA5 CMSIS">
      <description>System and Startup for Generic Arm Cortex-A5 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"      name="Device/ARMCA5/Include/ARMCA5.h"/>
        <!-- startup / system / mmu files -->
        <file category="sourceC"      name="Device/ARMCA5/Source/startup_ARMCA5.c" version="1.0.1" attr="config"/>
        <file category="linkerScript" name="Device/ARMCA5/Config/ARMCA5_ac6.sct"   version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCA5/Config/ARMCA5_gcc.ld"    version="1.0.0" attr="config" condition="GCC"/>
        <file category="linkerScript" name="Device/ARMCA5/Config/ARMCA5_iar.icf"   version="1.0.0" attr="config" condition="IAR"/>
        <file category="sourceC"      name="Device/ARMCA5/Source/system_ARMCA5.c"  version="1.0.1" attr="config"/>
        <file category="sourceC"      name="Device/ARMCA5/Source/mmu_ARMCA5.c"     version="1.2.0" attr="config"/>
        <file category="header"       name="Device/ARMCA5/Config/mem_ARMCA5.h"     version="1.1.0" attr="config"/>
      </files>
    </component>

