XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ARM.Cortex_DFP.pdsc
    <!-- Cortex-A7 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.2.0" condition="ARMCA7 CMSIS">
      <description>System and Startup for Generic Arm Cortex-A7 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"      name="Device/ARMCA7/Include/ARMCA7.h"/>
        <!-- startup / system / mmu files -->
        <file category="sourceC"      name="Device/ARMCA7/Source/startup_ARMCA7.c" version="1.0.1" attr="config"/>
        <file category="linkerScript" name="Device/ARMCA7/Config/ARMCA7_ac6.sct"   version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCA7/Config/ARMCA7_gcc.ld"    version="1.0.0" attr="config" condition="GCC"/>
        <file category="linkerScript" name="Device/ARMCA7/Config/ARMCA7_iar.icf"   version="1.0.0" attr="config" condition="IAR"/>
        <file category="sourceC"      name="Device/ARMCA7/Source/system_ARMCA7.c"  version="1.0.1" attr="config"/>
        <file category="sourceC"      name="Device/ARMCA7/Source/mmu_ARMCA7.c"     version="1.2.0" attr="config"/>
        <file category="header"       name="Device/ARMCA7/Config/mem_ARMCA7.h"     version="1.1.0" attr="config"/>
      </files>
    </component>

    <!-- Cortex-A9 -->
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup" Cversion="1.2.0" condition="ARMCA9 CMSIS">
      <description>System and Startup for Generic Arm Cortex-A9 device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="header"  name="Device/ARMCA9/Include/ARMCA9.h"/>
        <!-- startup / system / mmu files -->
        <file category="sourceC"      name="Device/ARMCA9/Source/startup_ARMCA9.c" version="1.0.1" attr="config"/>
        <file category="linkerScript" name="Device/ARMCA9/Config/ARMCA9_ac6.sct"   version="1.0.0" attr="config" condition="ARMCC6"/>
        <file category="linkerScript" name="Device/ARMCA9/Config/ARMCA9_gcc.ld"    version="1.0.0" attr="config" condition="GCC"/>
        <file category="linkerScript" name="Device/ARMCA9/Config/ARMCA9_iar.icf"   version="1.0.0" attr="config" condition="IAR"/>
        <file category="sourceC"      name="Device/ARMCA9/Source/system_ARMCA9.c"  version="1.0.1" attr="config"/>
        <file category="sourceC"      name="Device/ARMCA9/Source/mmu_ARMCA9.c"     version="1.2.0" attr="config"/>
        <file category="header"       name="Device/ARMCA9/Config/mem_ARMCA9.h"     version="1.1.0" attr="config"/>
      </files>
    </component>
  </components>


  <boards>
    <board name="uVision Simulator" vendor="Keil">
      <description>uVision Simulator</description>
      <mountedDevice    deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM0"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM0P"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM1"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM3"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM4"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM7"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM23"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM33"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM35P"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM55"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM85"/>
    </board>

    <board name="EWARM Simulator" vendor="IAR">
      <description>EWARM Simulator</description>
      <mountedDevice    deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM0"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM0P"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM1"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM3"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM4"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM7"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM23"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM33"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM35P"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM55"/>
      <compatibleDevice deviceIndex="0" Dvendor="ARM:82" Dname="ARMCM85"/>
    </board>
  </boards>

</package>